Table of Contents
 Class AutomationHosting<MyInterface, ClientInterface>
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Responsible of hosting an automation service on net.pipe endpoint
public class AutomationHosting<MyInterface, ClientInterface> : IBIMPluginClient<ClientInterface>, IDisposable where MyInterface : class where ClientInterface : class
Type Parameters
MyInterface
ClientInterface
Inheritance
object
AutomationHosting<MyInterface, ClientInterface>
Implements
IBIMPluginClient<ClientInterface>
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 AutomationHosting(MyInterface, IPluginLogger, string, string, string)
public AutomationHosting(MyInterface hostedService, IPluginLogger logger = null, string eventName = "IdeaStatiCaBIMPluginEvent", string clientUrlFormat = "net.pipe://localhost/IdeaBIMPlugin{0}", string automationUrlFormat = "net.pipe://localhost/IdeaStatiCaAuto{0}")
Parameters
hostedService MyInterface
logger IPluginLogger
eventName string
clientUrlFormat string
automationUrlFormat string
Properties
 HostingTask
public Task HostingTask { get; set; }
Property Value
Task
 MyBIM
Used for calling methods of connected BIM application
public ClientInterface MyBIM { get; }
Property Value
ClientInterface
 Service
public MyInterface Service { get; }
Property Value
MyInterface
 ServiceBaseAddress
public string ServiceBaseAddress { get; set; }
Property Value
string
 Status
Get status of the BIM application
public AutomationStatus Status { get; }
Property Value
AutomationStatus
Methods
 Dispose()
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
public void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool disposing)
Parameters
disposing bool
 NotifyBIMStatusChanged(AppStatus)
protected virtual void NotifyBIMStatusChanged(AppStatus newStatus)
Parameters
newStatus AppStatus
 RunAsync(string)
public Task RunAsync(string id)
Parameters
id string
Returns
Task
 RunServer(string, CancellationToken)
protected virtual void RunServer(string id, CancellationToken cancellationToken)
Parameters
id string
cancellationToken CancellationToken
 Stop()
Stops BIM application
public void Stop()
Events
 BIMStatusChanged
Notification about events in the connected BIM application
public event ISEventHandler BIMStatusChanged
Event Type
ISEventHandler
 Edit this page